[    
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3853448849/?alternateChannel=search&refId=EQL2%2F23Nl0ydYitcMnrflQ%3D%3D&trackingId=MFPzpr1zsgbk7Y6ISjhzyw%3D%3D",
    "companyName": "Wipro",
    "companyUrl": "https://www.linkedin.com/company/wipro/life",
    "jobTitle": "Cloud Engineer",
    "jobDescription": "About the job\n\nThe Team: This Senior Cloud Engineer will work closely with the other Cloud engineers and Developers in the Cloud engineering team to improve Kubernetes components and applications across multiple clusters and troubleshoot issues as needed.\n\nThe Impact: The Senior Cloud Engineer will play a consultative role and collaborate with the Security and Development teams.\n\nResponsibilities:\n\n• Administrate our Kubernetes EKS clusters and their lifecycle, in order to guarantee a high degree of reliability, security, scalability, and confidence at any given time, provide support, improve and implement Kubernetes internal components and applications on top of multiple EKS clusters and troubleshoot and triage issues as they arise.\n\n• Work closely with various teams across the organization, including the security team, development team, and operations team for any AWS infrastructure request.\n\n• Being able to excel with minimal technical supervision, embrace reliability constraints, be proactive, contribute improvements to the platform.\n\n• Encourage best practice policies, ability to adapt to various technologies and be willing to get involved with the Kubernetes and AWS community as needed.\n\n• Assist in troubleshooting EC, VPC networking, DNS and storage issues and make recommendations for cost saving options and growth.\n\n• Participate in a shared on-call rotation.\n\n• Lead and mentor junior team members.\n\nBasic Qualifications:\n\n•  - + Years’ experience in infrastructure design/implementation that directly aligns with the specific responsibilities for this position. (Required).\n\n• + years administering a EKS Kubernetes cluster in a production environment\n\n• Strong experience with identifying and remediating Kubernetes vulnerabilities.\n\n• Experience with maintenance such as Kubernetes patches and upgrades.\n\n• Experience managing multiple Kubernetes EKS clusters in a production environment\n\n• Strong Implementation and architecture experience in AWS services (e.g. EC, ECS, ELB, RDS, EFS, EBS, Route, VPC, IAM, CloudFront, CloudWatch, Lambda, S.\n\n• Expertise hands on experience and knowledge of various AWS cloud on prem datacenter services.\n\n• Strong experience in container platform infrastructure in AWS (EKS, ECS, Fargate)\n\n• Clear understanding of container technologies and the tools/challenges around them.\n\n• Ability to code/script in Python/Shell/PowerShell Language.\n\n• Senior level experience managing and administering Linux/Windows based systems.\n\n• Extensive AWS CloudFormation knowledge (YAML and/or JSON).\n\n• Systems monitoring experience (Prometheus, Grafana preferred).\n\n• Experience working with GitHub and supporting CI/CD pipelines.\n\n• Experience delivering projects via Agile methodologies\n\n• Excellent verbal and written communication skills.\n\nPreferred Qualifications:\n\n• Certified Kubernetes Administrator (CKA).\n\n• AWS Certified Solution Architect - Associate",
    "source": "LinkedIn",
    "jobType": "Full-Time",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-22T13:45:26.318321",
    "lastUpdated": "2024-03-22T13:45:26.318345"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3843654197/?alternateChannel=search&refId=EQL2%2F23Nl0ydYitcMnrflQ%3D%3D&trackingId=MFPzpr1zsgbk7Y6ISjhzyw%3D%3D",
    "companyName": "H2 Games",
    "companyUrl": "https://www.linkedin.com/company/h2-games/life",
    "jobTitle": "Back End Developer",
    "jobDescription": "About the job\n\nWe are looking for a Back-end Developer / Engineer to join our team. You will be responsible in the development and maintenance of back-end systems . Your expertise in web technologies will help us deliver quality products that captivate our audience.\n\n\n\n\nJob Responsibilities:\n\nLead the technical architecture and feature design of business systems and oversee code implementation；\nParticipate in the development and maintenance of internal information systems；\nContribute to the development and maintenance of internal workflow platforms.\n\n\n\n\nJob Requirements:\n\nBachelor's degree in Computer Science, Software Engineering, or any related field\nProficiency in the Java programming language, with expertise in mainstream technologies such as I/O, multithreading, Spring Boot, Spring Cloud, and MyBatis;\nProficiency in common databases and middleware, including MySQL, Redis, RocketMQ, and Elasticsearch;\nFamiliarity with design patterns and practical experience in abstract modeling, with a preference for candidates with domain model design experience in previous projects;\nSensitivity to business needs, with a track record of leading or participating in large-scale business software platform projects and serving as a core developer, with a preference for experience in process systems and middleware development;\nSelf-driven, skilled at identifying and articulating insights, and proactive in driving solutions;\nStrong ability to proactively facilitate issue resolution among team members.",
    "source": "LinkedIn",
    "jobType": "Full-Time",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-23T16:07:29.779998",
    "lastUpdated": "2024-03-23T16:07:29.78076"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3837514863/?alternateChannel=search&refId=avZKjCwOs93A9FHdXZam%2BA%3D%3D&trackingId=NXlBLk%2FBe3tKm%2FBNssNWSA%3D%3D&trk=d_flagship3_jobs_discovery_jymbii",
    "companyName": "igloo",
    "companyUrl": "https://www.linkedin.com/company/iglooco/life",
    "jobTitle": "Full Stack Engineer",
    "jobDescription": "About the job\n\nJob Purpose\n\n\n\n\nigloo is looking for a highly experienced and motivated Full Stack Engineer to work in a diverse group of engineers in the software engineering and R&D team. As a Full Stack Engineer at igloo, you will play a crucial role in designing, developing, and maintaining our web/backend applications.\n\n\n\n\nThe ideal candidate will have a strong background in programming languages, CI/CD pipelines, deployment processes, and experience with AWS Cloud services.\n\nigloo’s engineering teams are spread across China, Indonesia and Singapore and so cross-region liaising is required. While you will mostly be working with the software teams, but will also be working with hardware and firmware engineers for the role. This role reports to the Head of Software Engineering.\n\n\n\n\nDuties and Responsibilities:\n\n\n\n\nFront-end Development:\n\nDesign and implement responsive, user-friendly web interfaces using Flutter and TypeScript.\nCollaborate with UX/UI designers to ensure a seamless and visually appealing user experience.\nOptimize application performance and ensure compatibility across various browsers and devices.\n\n\n\n\nBack-end Development:\n\nDevelop robust and scalable server-side logic using modern frameworks and technologies.\nCollaborate with the backend team to design and implement APIs that facilitate smooth communication between the front-end and back-end systems.\nDevelop secure software solutions using cryptography.\nEnsure data and database security is well taken care of , for the data in rest and motion. \nCI/CD and Deployment:\nImplement and maintain continuous integration and continuous deployment (CI/CD) pipelines for efficient and automated software delivery.\nWork closely with DevOps teams to streamline deployment processes and ensure smooth releases.\n\n\n\n\nCloud Services:\n\nUtilize AWS Cloud services to build scalable and resilient applications.\nImplement and maintain cloud infrastructure components to support the development and deployment of applications.\n\n\n\n\nCollaboration and Communication:\n\nCollaborate with cross-functional teams, including product managers, designers, and other engineers, to deliver high-quality software solutions.\nCommunicate effectively with team members, providing updates on project progress and participating in technical discussions.\n\n\n\n\nRequirements/Qualifications:\n\n\n\n\nBachelor's degree in Computer Science, Engineering, or a related field.\nProven experience as a Full Stack Engineer with a strong focus on TypeScript, and back-end technologies.\nExperience with CI/CD pipelines, automated testing, and deployment processes.\nProficiency in AWS Cloud services and infrastructure management.\nStrong problem-solving skills and ability to work in a fast-paced, collaborative environment.\nExcellent communication and teamwork skills.\nAbility to speak Mandarin and English is required.\n\n\n\n\nRequired Skills/Abilities:\n\n\n\n\nExcellent verbal and written communication skills\nExtensive knowledge of engineering principles and procedures\nExcellent organizational skills and attention to detail\nStrong analytical and problem-solving skills\nPossess strong machine learning skills and adept at applying algorithms to the use cases.\nExperience working in a tech startup environment with software deployment at scale\nStrong leadership and mentorship skills\n\n\n\n\nWhat we can offer you\n\n\n\n\nExperience working in a high-growth startup\nChallenging work in a fun and collaborative environment\nSpacious open-concept and conveniently located office\nTeam lunches and company events\nMulticultural teams represented by + nationalities\nComprehensive corporate insurance and dental benefit\nExclusive staff discounts for company products\nFlexible working arrangements and casual work setting\n\n\n\n\nInterested applicants may send their CVs directly to Tessa at tessa.yeo@igloohome.co. Only shortlisted candidates will be notified.",
    "source": "LinkedIn",
    "jobType": "Full-Time",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-23T16:13:06.339753",
    "lastUpdated": "2024-03-23T16:13:06.339763"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3823730352/?alternateChannel=search&refId=w7b%2BJgqKcmUNgjcgxHjkeg%3D%3D&trackingId=QZeFOFUmlgUo1SEMSPQ7Xw%3D%3D&trk=d_flagship3_jobs_discovery_jymbii",
    "companyName": "RVS Consensus+",
    "companyUrl": "https://www.linkedin.com/company/rate-validation-services/life",
    "jobTitle": "Software Engineer",
    "jobDescription": "About the job\n\nWe require a talented Software Engineer to join our Singapore office, to assist in the design and development of new systems and features. A Singapore PR or citizen is preferred. This is an exciting opportunity to really make a difference, and to be involved in building software and systems which are important to the global banking system. \n\n\n\n\nJob Responsibilities\n\nCore systems development in C, T-SQL, WebAPI, JavaScript, Angular, PostgreSQL, and other technologies.\nDesign and development of highly scalable and testable code.\nWorking with other Software Engineers and Product specialists to deliver solutions while working to a prescribed timeline.\nSupport of our cloud systems as required, bug fixing and analysis.\n\n\n\n\nQualifications\n\nBachelor's degree or equivalent experience in Computer Science, Mathematics or a related field.\nCommercial experience in Full Stack software development of enterprise applications using .NET, C, SQL, Python, Angular, JavaScript and HTML.\nDeep knowledge of agile software development practices.\nWell-developed team work and interpersonal skills, with a proven ability to operate independently and communicate and work effectively in teams.\nAbility to find solutions to complex problems. \n\n\n\n\nExperience Guide\n\nC / .NET: + years \nSQL Skills: + years\nWeb development: + years\n\n\n\n\nAbout RVS\n\nRVS is a Fintech company offering cloud based financial services to our global customers. We are the leading independent provider of derivative volatility pricing services for OTC Global Derivative Markets. We have offices in London, Singapore and Sydney. Our cloud based services and high quality data increase the capital efficiency of investment banks, and improve their risk and valuation management processes.",
    "source": "LinkedIn",
    "jobType": "Full-Time",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-25T16:16:12.904862",
    "lastUpdated": "2024-03-25T16:16:12.904873"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3742045902/?alternateChannel=search&refId=EQL2%2F23Nl0ydYitcMnrflQ%3D%3D&trackingId=MFPzpr1zsgbk7Y6ISjhzyw%3D%3D",
    "companyName": "Agoda",
    "companyUrl": "https://www.linkedin.com/company/agoda/life",
    "jobTitle": "[Tech Cooperative Internship 2024] Software Engineer in Back End intern (6 months)",
    "jobDescription": "About the job\nAbout Agoda\n\nAgoda is an online travel booking platform for accommodations, flights, and more. We build and deploy cutting-edge technology that connects travelers with more than . million accommodations globally. Based in Asia and part of Booking Holdings, our ,+ employees representing + nationalities foster a work environment rich in diversity, creativity, and collaboration. We innovate through a culture of experimentation and ownership, enhancing the ability for our customers to experience the world.\n\n Our Purpose –  Bridging the World Through Travel \n\nWe believe travel allows people to enjoy, learn and experience more of the amazing world we live in. It brings individuals and cultures closer together, fostering empathy, understanding and happiness.\n\nWe are a skillful, driven and diverse team from across the globe, united by a passion to make an impact. Harnessing our innovative technologies and strong partnerships, we aim to make travel easy and rewarding for everyone.\n\nAgoda Platform team is looking for developers to work on mission critical systems that deals with the designing and development of a system that serves millions of users every day. The desired candidate will be actively involved with the integration of Agoda with new hotel partners via APIs to be able to Agoda customers with best prices. With APIs, hotel partners can automatically and instantly send all necessary required to maintain their hotel listings on agoda.com. It optimizes and provides a seamless experience where hotel partners can generate more incremental business via our platforms.\n\nJob Scope:\n\nThe intern will be part of a team of experienced software engineer to help integrate with more partners and/or improve existing integrations.\n\nKey Skill sets:\n\n\nVery good understanding of core computer science knowledge and strong ability to apply this knowledge using Java\nKnowledgeable in using Databases and writing SQL queries\nGood command of the English language\nPassion for crafting software and improving your knowledge and skills\n\n\nDuration of internship:\n\n\nAt least  months\nFull-time internship (working  days a week)\n\n\nStudents singapore\n\nEqual Opportunity Employer \n\nAt Agoda, we pride ourselves on being a company represented by people of all different backgrounds and orientations. We prioritize attracting diverse talent and cultivating an inclusive environment that encourages collaboration and innovation. Employment at Agoda is based solely on a person’s merit and qualifications. We are committed to providing equal employment opportunity regardless of sex, age, race, color, national origin, religion, marital status, pregnancy, sexual orientation, gender identity, disability, citizenship, veteran or military status, and other legally protected characteristics.\n\nWe will keep your application on file so that we can consider you for future vacancies and you can always ask to have your details removed from the file. For more details please read our privacy policy .\n\nTo all recruitment agencies: Agoda does not accept third party resumes. Please do not send resumes to our jobs alias, Agoda employees or any other organization location. Agoda is not responsible for any fees related to unsolicited resumes.",
    "source": "LinkedIn",
    "jobType": "Internship",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-25T16:19:19.890763",
    "lastUpdated": "2024-03-25T16:19:19.890773"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3810586348/?alternateChannel=search&refId=4yzLjy%2FIu7QvYayTIGDzhg%3D%3D&trackingId=muEfVNcBgfh2jtihf82iLg%3D%3D&trk=d_flagship3_jobs_discovery_jymbii",
    "companyName": "dormakaba",
    "companyUrl": "https://www.linkedin.com/company/dormakaba/life",
    "jobTitle": "Cloud Software Developer",
    "jobDescription": "About the job\nPosition Overview\n\ndormakaba is looking for a Cloud Software Developer to develop and maintain solutions for our Global Innovation APAC Product Development group.\n\nWhat You Will Do\n\n\n Translate design documents into actual code and solution developments that have good functionality and are of high quality \n Respond to changes in initial requirements and work in an agile manner to deliver iterative features \n Ensure that codes developed are tested, maintained, and documented \n\n\nWhat We Require\n\n\n Bachelor’s or Master’s degree in Engineering (Computer/Telecommunication), Computer Science / IT or equivalent \n + yrs. proven work experience as a Full Stack Developer or similar role \n Strong proficiency with JavaScript and Node.js \n Familiarity with microservices, serverless architectures \n Knowledge of back-end languages (e.g. Python) \n Proficient understanding of code versioning tools, such as Git \n Strong knowledge and experience with AWS cloud development for product systems, including but not limited to: Lambda, API Gateway, IoT, Cognito, DynamoDB \n Familiarity with relational and non-relational database technologies (e.g. NoSQL, MongoDB, etc.) \n Fluency in English \n\n\nWhat We Prefer\n\n\n Terraform experience \n Knowledge of Front-End Javascript Frameworks (e.g. Angular, React) \n Knowledge of Linux, shell scripting \n\n\nWhat We Offer\n\n\n Learning culture where every employee is engaged in learning and development growth. \n Team programs and activities that celebrate individual and team’s success. \n Learning culture where every employee is engaged in learning and development growth. \n Company transport is provided (pick-up points: Boon Lay & Serangoon). \n\n\n WHY JOIN DORMAKABA? \n\nWe are at the heart of every place that matters. As a leading global provider in the access solutions market for schools, banks, airports, hospitals, and hotels, we enable seamless movement within secure, safe, and sustainable places. Our work is IMPORTANT. YOU are important. We provide our people with the tools to shape their careers for growth. With around , employees worldwide, EVERY team member contributes to our mission and can make a positive difference. By working as one global team, we continue Growing the Business, Growing Together, and Growing Ourselves. Build your career with us!\n\nLearn why our employees enjoy working for us, click here to view  dormakaba testimonials",
    "source": "LinkedIn",
    "jobType": "Full-Time",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-21T16:22:21.35184",
    "lastUpdated": "2024-03-21T16:22:21.351849"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3834668279/?alternateChannel=search&refId=bd2wIuH9cfgBpDyeg1sTRA%3D%3D&trackingId=39imksjwd2Fb4aC1siQADw%3D%3D&trk=d_flagship3_jobs_discovery_jymbii",
    "companyName": "Maltem Asia-Pacific",
    "companyUrl": "https://www.linkedin.com/company/maltem-asia-pacific/life",
    "jobTitle": "Full Stack Developer (React_Python_Django_DevOps_Kubernetes)",
    "jobDescription": "About the job\nMaltem Singapore is currently seeking a Full Stack Developer (FIXED INCOME) for our Wealth Management Client.\n\n\n\n\nSummary :\n\nThe successful candidate will support in-house analytics dashboard for Fixed Income Multi Asset.\n\n\n\n\nResponsibilities :\n\nGood understanding of full System Development Life Cycle for Web based applications.\nEnsure compliance with IT security standards, policies and procedures.\nGood understanding of ITIL processes, with experience in an ITIL based environment.\nGood problem solving, analytical, written and communication skills.\n\n\n\n\n\n\n\nKnowledge, Skills and Experience :\n\nPossess a Degree in Computer Science/Information Technology or related fields.\n to  years of relevant working experience.\nREACT Development experience in Functional and Class Based Component.\nExperience in PYTHON and DJANGO for Backend Development.\nComfortable to perform a Coding Test.\n\n\n\n\nGood-To-Have :\n\nDevOps experience in Kubernetes, deployment and automation.",
    "source": "LinkedIn",
    "jobType": "Full-Time",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-21T16:27:53.32714",
    "lastUpdated": "2024-03-21T16:27:53.327148"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3831573234/?alternateChannel=search&refId=ODfGfD%2FSNa0HoKt48d%2FcpA%3D%3D&trackingId=3X4Uj1wfPGIg2l8qVbWULQ%3D%3D&trk=d_flagship3_jobs_discovery_jymbii",
    "companyName": "EZ-Link Pte Ltd",
    "companyUrl": "https://www.linkedin.com/company/ez-link/life",
    "jobTitle": "Software Developer",
    "jobDescription": "About the job\n\nAs a Software Developer, you will work closely with Product Owners, Business Analysts and other team members. Reporting to the Head of Department, and working alongside a team of software professionals, you will develop and maintain functionalities to support EZ-Link’s Transit and Payment eco-system and legacy applications, and in doing so, be at the forefront of transformation in EZ-Link.\n\n\n\n\nResponsibilities: \n\nWork in the Agile team and work closely with Product Owners, Business Analysts and other team members to achieve common goals. \nDevelop/maintain functionalities to support EZ-Link’s Transit and Payment eco-system and legacy applications. \nParticipate in the activities such as design, tasks estimation, development, unit testing, releases and production support. \nImprove code quality and perform code reviews. \nDevelop/maintain automated unit test scripts, perform unit testing and validation of requirements with BA/users/stakeholders. \nPerform investigation/troubleshooting of issues raised on mobile application/microservices/applications. \nKeep up-to-date with new technologies, explore and experiment technologies that will help to improve technical efficiencies. \nProvide training to end users and documentation to support knowledge transfer. \nDevelop Proof-of-Concept for new ideation or initiatives. \nIdentify areas of improvement, improve development efficiency and application quality. \nConduct and lead code review session. \n\n \n\nRequirements: \n\nPreferably with a Degree in Computer Science/Information Systems or relevant field. \nPreferably more than  years of software development experience. \nHave knowledge/experience in Agile Methodology. \nProficient in Kotlin, or Java. \nProficient in Spring Boot framework, and native SQL. \nExperience in Azure SQL, Redis and Oracle will be an advantage. \nExperience with Sonar Qube, Docker containers, Orchestration tools, Elastic Search & Kibana (ELK), Grafana, Jira and Confluence will be an advantage. \nExperience or possess knowledge in Payments domain (eg. QR, payment flow), secured API/Web Service, OAuth security framework and JWE/JWS will be an advantage. \nWell organized, good interpersonal, multi-tasking and communication skills",
    "source": "LinkedIn",
    "jobType": "Full-Time",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-21T16:29:38.397756",
    "lastUpdated": "2024-03-21T16:29:38.397765"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3765105963/?alternateChannel=search&refId=9fMPle5Wk%2Bu%2F2q9%2BjuxHJw%3D%3D&trackingId=u80fBYwofrHNEjEnHkZRbA%3D%3D&trk=d_flagship3_jobs_discovery_jymbii",
    "companyName": "Xiaomi Technology",
    "companyUrl": "https://www.linkedin.com/company/xiaomi-technology/life",
    "jobTitle": "Big Data Software Engineer",
    "jobDescription": "About the job\n\nAbout The Company:\n\nXiaomi Corporation was founded in April  and listed on the Main Board of the Hong Kong Stock Exchange on July ,  (.HK). Xiaomi is a consumer electronics and smart manufacturing company with smartphones and smart hardware connected by an IoT platform at its coreC.\n\n\n\n\nEmbracing our vision of “Make friends with users and be the coolest company in the users’ hearts”, Xiaomi continuously pursues innovations, high-quality user experience and operational efficiency. The company relentlessly builds amazing products with honest prices to let everyone in the world enjoy a better life through innovative technology.\n\n\n\n\nXiaomi is one of the world's leading smartphone companies. The company’s market share in terms of smartphone shipments ranked no.  globally in the second quarter of .\n\n\n\n\nResponsibilities:\n\nWork with product managers and data analysts to design data-related products.\nAssemble large, complex data sets that meet functional / non-functional business requirements.\nBuild the infrastructure and tools required for optimal extraction, transformation, and loading of data from a wide variety of data sources.\nWork with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.\nDesign and implement Data as a Service ( DaaS ) for analytics and data scientist team members that assist them in developing intelligent agile operation.\nIdentify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.\n\n\n\n\nQualifications:\n\nBS/MS Degree in Computer Science or related major.\nExperienced working knowledge of big data technologies such as Hadoop, Hive, Spark, etc.\nFamilar with common SQL/NoSQL databases such as MySQL, Redis, etc.\nDeep understanding of computer architectures, data structures and algorithms.\nCoding proficiency in at least one modern programming language (Python, Ruby, Java, etc.)\nHave good communication and collaboration skills.",
    "source": "LinkedIn",
    "jobType": "Full-Time",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-27T16:30:19.353634",
    "lastUpdated": "2024-03-27T16:30:19.353642"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3846210202/?alternateChannel=search&refId=TZEjE1uJoVznll%2Ba4aIH%2FQ%3D%3D&trackingId=nVrQfjvES%2B3h9uo2NRNbGg%3D%3D",
    "companyName": "MagicBlock Labs",
    "companyUrl": "https://www.linkedin.com/company/magicblock/life",
    "jobTitle": "Frontend Developer",
    "jobDescription": "About the job\n\nAbout us\n\nMagicBlock Labs is a gaming and technology company building infrastructure for fully onchain games. We are trailblazers, unafraid of challenging the status quo to solve complex problems. We are passionate about gaming as much as we love open-source and building in collaboration with our community. Backed by Tier  investors, our team is a mix of technical and creative talent on a quest to define a new vision for open, permissionless and unstoppable games.\n\n\n\n\nRole Overview\n\nWe're looking for a Front-End Developer to work on a pipeline of upcoming products within the MagicBlock offering. You will help build developer tools and consumer-facing applications. You will have the chance to spearhead products that are pivotal to the success of the games developed with the rest of our stack.\n\n\n\n\nKey Responsibilities\n\nDevelopment & Implementation: Design and develop compelling, efficient, and secure front-end solutions. Translate design mockups and wireframes into front-end code, considering user experience and interface fluidity.\nProject Management: Manage front-end projects from conception to deployment, ensuring timely delivery and quality. Ensure that project goals are met and align with business objectives.\nUsers interviews: You will be interfacing directly with our end-users and developers, collecting feedback to inform the direction of the product.\nPerformance Optimization: Monitor application performance, conduct rigorous testing, and iterate on feedback to optimize for speed, efficiency, and scalability.\n\n\n\n\nQualifications\n\nMinimum of  years of experience in web development and/or consumer-facing product.\nGood working knowledge of React / TypeScript / styled-components\nHigh-agency, self-driven, and passionate about crypto and/or gaming\nYou take a pragmatic approach to developing clean solutions to complex\nEnglish language proficiency\n\nBonus if:\n\nExperience with Solana web.js / ethers.js\n\n\n\n\nBenefits:\n\nCompetitive compensation and generous stock options plans (signing bonus & performance-based)\nFully remote, flexible working schedule\nPaid quarterly offsites, conferences and travels.\nMedical, Dental, Vision insurance (US)\nNew laptop and/or budget for work equipment\n\n\n\n\nMagicBlock Labs is an equal opportunity employer.",
    "source": "LinkedIn",
    "jobType": "Full-Time",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-24T03:29:50.370855",
    "lastUpdated": "2024-03-24T03:29:50.370875"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3783567440/?alternateChannel=search&refId=ucE3UlyAlkEHXgxcUgnsSA%3D%3D&trackingId=EXJWVUL4RKYUa3KI5MMSfA%3D%3D&trk=d_flagship3_jobs_discovery_jymbii",
    "companyName": "ShopBack",
    "companyUrl": "https://www.linkedin.com/company/shopback-com/life",
    "jobTitle": "Software Engineer (Intern) - Frontend",
    "jobDescription": "About the job\nAbout Us\n\nThe ShopBack Group is Asia-Pacific’s leading shopping, rewards, and payments platform, serving over  million shoppers across  markets. In , the Group expanded its offerings into Germany, signalling its entry into the European market.\n\nDriven by the vision to be the world's most rewarding way to shop, ShopBack is dedicated to saving members money and time, while delivering delightful experiences with every purchase. The platform also enables merchants and brands to engage with their members in a cost-effective manner.\n\nFounded in , ShopBack now powers over US$ billion in annual sales for over , online and in-store partners. Facilitating upwards of half a million transactions daily, ShopBack continues to provide value to both members and merchants through its innovative offerings. Notably, its payment solution, ShopBack Pay, offers members a convenient and rewarding payment option at checkout.\n\n==========\n\nResponsibilities\n\n\nBuild stable, performant and highly available applications for our customers, merchants, and operators\nWork on modern frontend web applications\nDesign and build APIs for meaningful user experiences on web and mobile\nImproving and automating engineering processes to improve delivery velocity and quality\n\n\n\nWhat We Look For\n\n\nStrong knowledge of HTML, CSS, and JavaScript\nSome experience with relational or non-relational databases\nStrong written and verbal communication skills\nActive team player with strong problem-solving skills\nAttention to detail and demonstrable design and UX sensibilities\nExperience with client-side frameworks is a plus (Angular, Ember, Vue, React etc)-- Needed\nExperience with server-side frameworks is a plus (Rails, Django, Spring, Nestjs, Nextjs etc)\nApplicants from all varsities are welcome to apply, including University, Polytechnic, and ITE\nMinimum commitment period of  months, full time",
    "source": "LinkedIn",
    "jobType": "Internship",
    "remark": null,
    "coverLetter": null,
    "status": "Applied",
    "createdOn": "2024-03-27T03:30:14.358274",
    "lastUpdated": "2024-03-27T03:30:14.358282"
  },
  {
    "applicationUrl": "https://www.linkedin.com/jobs/view/3864957417/?alternateChannel=search&refId=ucE3UlyAlkEHXgxcUgnsSA%3D%3D&trackingId=0Hkf6mo22XXQjc46W54LwQ%3D%3D&trk=d_flagship3_jobs_discovery_jymbii",
    "companyName": "BandLab Technologies",
    "companyUrl": "https://www.linkedin.com/company/bandlab/life",
    "jobTitle": "Frontend Engineer, Studio",
    "jobDescription": "About the job\n\nWe're looking for a Frontend Engineer who can support our frontend team in crafting exceptional user experiences for music makers. You will play a role in making technical decisions, build prototypes, and develop user-facing features. If you're passionate about shaping the future of music production, this opportunity is perfect for you.\n\n\n\n\nKey Responsibilities\n\n\n\n\nWork closely with audio and backend developers to define the APIs and data structures that the frontend will consume\nCollaborate in cross-functional teams to create prototypes, as well as user-facing features in our products\nOptimize existing web applications to maximize performance and scalability\nDevelop performant web applications running on both desktop and mobile browsers, as well as web views embedded in mobile applications\nBuild and design libraries and plugins that improve development efficiency and code quality\nBe responsible for developing performance monitoring, error tracking and other efficiency tools to improve troubleshooting efficiency\nParticipate in code reviews and contribute to continuous improvement through refactoring and implementing new design patterns and approaches\n\n\n\n\nSkills, Knowledge and Expertise\n\n\n\n\nExperience in developing audio applications using Web Audio API\n-+ years of experience in frontend development\nBroad knowledge of various strategies and methods for optimizing browser rendering\nProficient in HTML/CSS techniques for building appealing UI while maintaining accessibility\nProficient in Vue, but also in some older UI frameworks/libraries, such as AngularJS, jQuery, etc., or simply vanilla HTML/JS\nDeep understanding of the underlying mechanisms of popular UI rendering frameworks, such as React, Vue, or Svelte\nExperience with modern front-end technologies, such as Vite, Rollup, Parcel, etc.\nUnderstanding of design principles and user experience design\nStrong analytical and debugging skills, with the ability to troubleshoot and fix complex issues in the frontend codebase\nStrong communication skills, with the ability to explain technical concepts to technical and non-technical stakeholders\n\n\n\n\nLocation and Benefits\n\n\n\n\nHealthcare, dental insurance\nAttractive paid annual leave, sick leave, childcare leave, volunteer leave and maternity leave\nBandLab Technologies staff discount\nQuarterly bonus\n\n\n\n\nThis role is based in Singapore.",
    "source": "LinkedIn",
    "jobType": "Full-Time",
    "remark": null,
    "coverLetter": null,
    "status": "Interview",
    "createdOn": "2024-03-26T03:30:35.008074",
    "lastUpdated": "2024-03-26T05:13:52.149933"
  }
]